app/views/pessoas/_form.html.erb

SELECT "empresas".* FROM "empresas"
---
    <%= f.label :empresa %><br />
    <%= collection_select(:pessoa, :empresa_id, Empresa.all, :id, :razao_social) %>