app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT "empresas".* FROM "empresas"

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save
---
INSERT INTO "empresas" ("cnpj", "created_at", "descricao", "razao_social", "telefone", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?)