app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def show
    @pessoa = Pessoa.find(params[:id])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @pessoa = Pessoa.find(params[:id])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @pessoa = Pessoa.new(params[:pessoa])

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("created_at", "empresa_id", "nome", "sexo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 13 Nov 2011 04:05:54 UTC +00:00], ["empresa_id", 1], ["nome", "asd"], ["sexo", nil], ["updated_at", Sun, 13 Nov 2011 04:05:54 UTC +00:00]]

  def update
    @pessoa = Pessoa.find(params[:id])

    respond_to do |format|
      if @pessoa.update_attributes(params[:pessoa])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "pessoas" SET "empresa_id" = 2, "updated_at" = '2011-11-13 04:17:21.940349' WHERE "pessoas"."id" = 3